
export default defineEventHandler(async (event) => {
    const parsed = parseFormattedText(text);
    
    console.log(data);
    
});

const text = `**Снижение количества проведенных занятий**                                                                                
- Несмотря на рост числа активных клиентов и доходов, количество проведенных занятий снизилось почти на 5%. Это может указывать на перегрузку преподавательского состава или проблемы с расписанием.      

**Неравномерное соотношение полов среди участников**
- Только 20% участников — мальчики. С учетом того, что занятия проходят в Екатеринбурге, стоит обратить внимание на привлечение мальчиков к творческим занятиям через специальные акции или мероприятия.  

**Ограниченное число возрастных групп**
- В возрасте от 10 до 14 лет наблюдается высокая активность, однако группа подростков (15–17 лет) относительно небольшая. Важно учесть интерес этой возрастной категории и разработать подходящие программы, чтобы удержать этих клиентов.

**Отсутствие роста новых клиентов**
- Хотя новые клиенты появились, прирост составил всего 11%, а процент возвращающихся клиентов хоть и увеличился, но незначительно. Это говорит о необходимости активизации маркетинговых мероприятий и повышения узнаваемости секции.

**Высокая зависимость от помесячной оплаты**
- Использование только помесячного формата оплаты ограничивает стабильность денежных потоков и делает организацию уязвимой перед резкими изменениями спроса. Стоит рассмотреть возможность внедрения абонементов на несколько месяцев вперед.`;

